test_examples/tube_OpenFoam3d_abaqus3d2/CFD/0/ccx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
0.024479
0.023437
0.022396
0.021354
0.020312
0.019271
0.018229
0.017187
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.025
-0.025
-0.025
-0.025
-0.025
-0.025
-0.025
-0.025
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.025
0.025
0.025
0.025
0.025
0.025
0.025
0.025
...
)
;
    }
    mantle
    {
        type            calculated;
        value           nonuniform List<scalar> 
1536
(
-0.024479
-0.024479
-0.024479
-0.024479
-0.024479
-0.024479
-0.024479
-0.024479
...
)
;
    }
}


// ************************************************************************* //
