test_examples/tube_OpenFoam3d_abaqus3d2/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     CoCoNuT_pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  5;

writeCompression uncompressed;

timeFormat      fixed;

timePrecision   4;

runTimeModifiable false;

adjustTimeStep	no;

boundary_names (mantle);

functions 
{ 
  
 	 PRESSURE_mantle 
	 { 
		 type  	 surfaceRegion; 
		 libs 	 ("libfieldFunctionObjects.so"); 
		 executeControl 	 timeStep; 
		 executeInterval 	 1; 
		 writeControl 	 timeStep; 
		 writeInterval 	 1; 
		 timeFormat 	 fixed; 
		 timePrecision 	 4; 
		 operation 	 none; 
		 writeFields 	 true; 
		 surfaceFormat 	 raw; 
		 regionType 	 patch; 
		 name 	 mantle ; 
		 fields 
		 ( 
			 p 
 		 ); 
	 } 

 
 	 wallShearStress 
	 { 
		 type  	 wallShearStress; 
		 libs 	 ("libfieldFunctionObjects.so"); 
		 executeControl 	 timeStep; 
		 executeInterval 	 1; 
		 writeControl 	 timeStep; 
		 writeInterval 	 1; 
		 timeFormat 	 fixed; 
		 timePrecision 	 4; 
		 log 	 false; 
	 } 

 
 	 TRACTION_mantle 
	 { 
		 type  	 surfaceRegion; 
		 libs 	 ("libfieldFunctionObjects.so"); 
		 executeControl 	 timeStep; 
		 executeInterval 	 1; 
		 writeControl 	 timeStep; 
		 writeInterval 	 1; 
		 timeFormat 	 fixed; 
		 timePrecision 	 4; 
		 operation 	 none; 
		 writeFields 	 true; 
		 surfaceFormat 	 raw; 
		 regionType 	 patch; 
		 name 	 mantle ; 
		 fields 
		 ( 
			 wallShearStress 
		 ); 
	 } 

} 
 
// ************************************************************************* //
